app/controllers/api/v1/articles_controller.rb

    def index
     @articles = Article.all
---
SELECT "articles".* FROM "articles"

    def set_article
     @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]