app/controllers/api/v1/registrations_controller.rb

    def create
        my_password = BCrypt::Password.create(registration_params[:password])
        @registration = Registration.new(registration_params.merge(password_digest: my_password))
     if @registration.save
---
INSERT INTO "registrations" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Nitesh"], ["email", "nb9397@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-05-05 10:33:54.986232"], ["updated_at", "2023-05-05 10:33:54.986232"]]
INSERT INTO "registrations" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Nitesh2"], ["email", "nk9397@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-05-05 10:54:31.290112"], ["updated_at", "2023-05-05 10:54:31.290112"]]