app/controllers/application_controller.rb

SELECT "registrations".* FROM "registrations" WHERE "registrations"."password_digest" = ? LIMIT ?  [["password_digest", "[FILTERED]"], ["LIMIT", 1]]
---
	def verify_user
		unless Registration.find_by(password_digest: request.authorization.gsub("Bearer ", "")).present?